# Домашнее задание к работе 2

## Условие задачи
Составьте программу для определения сдачи после покупки в магазине товара:
перчаток стоимостью А руб., портфеля стоимостью Б руб., галстука стоимостью С руб.
Исходная сумма, выделенная на покупку – Д руб. В случае нехватки денег сдача
получится отрицательной.

## 1. Алгоритм и блок-схема

### Алгоритм
1. **Начало**
2. Объявить константы:
   - `A` = 400 — цена перчаток.
   - `B` = 2000 — цена портфеля.
   - `C` = 300 — цена галстука.
3. Задать исходные данные:
   - `D` = 3000 — исходная сумма.
4. Вычислить:
   - `D - (A+B+C)`
5. Выводим результаты расчетов с подстановкой всех значений:
   - `printf("Сдача: %dp\n", D - (A + B + C));`
6. **Конец**

### Блок-схема
file:///C:/Users/79036/Downloads/lab_2_schema.png.drawio.html

## 2. Реализация программы

#include <locale.h>
#include <stdio.h>
#include <stdlib.h>
int main() 
{
    setlocale(LC_ALL, "RUS");
    int A = 400;
    int B = 2000;
    int C = 300;
    int D = 3000;

    printf("цена перчаток: %dp\n", A);
    printf("цена портфеля: %dp\n", B);
    printf("цена галстука: %dp\n", C);
    printf("исходная сумма: %dp\n", D);

    printf("Сдача: %dp\n", D - (A + B + C));
}

## 3. Результаты работы программы

цена перчаток: 400p
цена портфеля: 2000p
цена галстука: 300p
исходная сумма: 3000p
Сдача: 300p

